cases/caseA/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

x0  -0.18;  x1  0.18;
y0  -0.18;  y1  0.18;
z0  -0.3; z1  0.3;

vertices
(
    ($x0 $y0 $z0) ($x1 $y0 $z0) ($x1 $y1 $z0) ($x0 $y1 $z0)
    ($x0 $y0 $z1) ($x1 $y0 $z1) ($x1 $y1 $z1) ($x0 $y1 $z1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (48 48 80) simpleGrading (1 1 1)
);

defaultPatch { name farField; type patch; }

boundary ();
