cases/caseA/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    model        kOmegaSST;
    turbulence   on;
    printCoeffs  on;
}
