cases/caseA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    farField
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    propeller
    {
        type            noSlip;
    }
}
