cases/caseA/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1.0;

boundaryField
{
    farField
    {
        type            inletOutlet;
        inletValue      uniform 1.0;
        value           uniform 1.0;
    }
    propeller
    {
        type            omegaWallFunction;
        value           uniform 1.0;
    }
}
