cases/caseA/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;
method          scotch;
