cases/caseA/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("propeller.stl");
includedAngle 150;
