cases/caseA/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM-12  propeller MRF case  (generated by scripts/gen_case.py)          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    rotorCells;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        point1  (0 0 -0.035);
        point2  (0 0 0.035);
        radius  0.056;
    }
    {
        name    rotor;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     rotorCells;
    }
);
